Tekla.Structures.Model.BaseComponentExtensions
The Tekla.Structures.Model.BaseComponentExtensions class provides a set of static methods for querying objects that implement Tekla.Structures.Model.BaseComponent.

Tekla.Structures.Model.BaseComponentExtensions.GetModelObjects(Tekla.Structures.Model.BaseComponent)
Gets the Tekla.Structures.Model.ModelObject instances part of the Tekla.Structures.Model.BaseComponent.
baseComponent: The component to get the objects from.
Returns: The collection of Tekla.Structures.Model.ModelObject instances part of the given Tekla.Structures.Model.BaseComponent.

Tekla.Structures.Model.BaseComponentExtensions.GetModelObjects(Tekla.Structures.Model.Connection)
Gets the Tekla.Structures.Model.ModelObject instances part of the Tekla.Structures.Model.Connection.
connection: The component to get the objects from.
Returns: The collection of Tekla.Structures.Model.ModelObject instances part of the given Tekla.Structures.Model.Connection.

Tekla.Structures.Model.BaseComponentExtensions.GetModelObjects(Tekla.Structures.Model.Detail)
Gets the Tekla.Structures.Model.ModelObject instances part of the Tekla.Structures.Model.Detail.
detail: The component to get the objects from.
Returns: The collection of Tekla.Structures.Model.ModelObject instances part of the given Tekla.Structures.Model.Detail.

Tekla.Structures.Model.BaseComponentExtensions.GetModelObjects(Tekla.Structures.Model.Seam)
Gets the Tekla.Structures.Model.ModelObject instances part of the Tekla.Structures.Model.Seam.
seam: The component to get the objects from.
Returns: The collection of Tekla.Structures.Model.ModelObject instances part of the given Tekla.Structures.Model.Seam.

Tekla.Structures.Model.BaseComponentExtensions.TryGetClosestEdge(Tekla.Structures.Model.BaseComponent,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Segment3@)
Tries to resolve the edge on baseComponent that is closest to point.
baseComponent: The Tekla.Structures.Model.BaseComponent to get the closest segment from.
point: The Tekla.Common.Geometry.Vector3 to get the closest segment to.
closestEdge: The Tekla.Common.Geometry.Segment3 of the given Tekla.Structures.Model.BaseComponent that is closest to point.
Returns: True if baseComponent defines resolvable segments; otherwise, false.